var glossary = [{initial:"英数字", words:[{word:"Administrator" ,desc:"Windowsにログオンするときのアクセス権の一種です。Administrator権限でログオンしたコンピューターに対しては、あらゆる操作や設定を行なうことができます。"},{word:"Canon Driver Information Assist Service" ,desc:"コンピューターに接続されたデバイス情報を取得するためのソフトウェアです。共有プリンター環境でデバイス情報を取得して自動的にドライバーの設定を行なう場合や、部門管理機能を使用する場合には、プリントサーバー上にCanon Driver Information Assist Serviceがインストールされている必要があります。"},{word:"IPv4/IPv6" ,desc:"Internet Protocol version 4（インターネットプロトコルバージョン4）/Internet Protocol version 6（インターネットプロトコルバージョン6）。IPv4 のアドレスは32 ビットの数値を使用し、2 の32 乗個（約43 億個。億は10 の8 乗）の固有アドレスを区別することができます。IPv6 は、情報機器の普及などにより、43億個のアドレスでは対応できなくなってきたこと、およびIPv4 で問題となっていたことを解決するために、アドレスが128 ビットに拡張されています。IPv6 のアドレスは、2 の128 乗個（約340 潤個：澗は漢数字「一十百千万億兆京垓杼穣溝」の次の位で、10 の36 乗）とほぼ無限の固有アドレスを区別することができます。"},{word:"LIPS" ,desc:"Laser beam printer Image Processing Systemの略。キヤノンによって開発されたページ記述言語です。LIPSが使用されているプリンタードライバーには、さまざまなコンピューター環境に対応し、帳票印刷に便利なフォームオーバーレイ機能をはじめ、さまざまな印刷機能を設定できる「LIPS4」や、印刷データの処理をコンピューターとプリンターで負荷分散することによって、従来よりも高速で安定した印刷ができる「LIPSLX」などがあります。"},{word:"NetSpot Device Installer" ,desc:"ネットワークに接続されているキヤノン製デバイスのネットワークプロトコルの初期設定を行うユーティリティーソフトウェアです。 新規に導入したデバイスのネットワーク設定を簡単に行うことができます。また設定済みデバイスの状態を簡易的に一覧で表示することができます。"},{word:"NetSPot Job Monitor" ,desc:"ローカル環境またはネットワーク環境で接続されているプリンターも含め、プリンターの状態や印刷ジョブを確認するためのユーティリティーソフトウェアです。"},{word:"NetWare" ,desc:"Novell社が開発したクライアントサーバーネットワークOSです。標準のプロトコルとしてIPX/SPX、NetBEUI あるいはTCP/IPを利用します。MS-DOS、Windows、OS/2、UNIX およびMacintoshのクライアントに対応しています。"},{word:"PDF" ,desc:"Portable Document Formatの略。Adobe社の提唱する業界標準のフォーマット。 さまざまなアプリケーションデータやイメージデータを、Adobe Acrobatを使用して圧縮した形式です。Adobe Reader/Adobe Acrobatなどで参照でき、異なるアプリケーションで作成した文書でも、元のレイアウトを維持したまま表示することが可能です。PDFファイル形式の文書にはテキストやグラフィック、画像など複数の要素を含めることができます。"},{word:"PostScript" ,desc:"Adobe社によって開発されたページ記述言語です。フォントの表現に柔軟性があり、DTPソフトウェアでの使用に適しています。"},{word:"PPDファイル" ,desc:"PostScript Printer Descriptionファイル（プリンター記述ファイル）の略。PostScriptプリンターで機種ごとの機能情報が記載されているファイルです。印刷時にPostScriptプリンターのドライバーが参照します。 "},{word:"PS" ,desc:"PostScriptの略。"},{word:"Readmeファイル" ,desc:"ソフトウェアに付属するファイルです。ソフトウェアの使用方法や注意事項、制限事項などが記載されています。"},{word:"TCP/IP" ,desc:"インターネットや大規模ネットワークにアクセスするのに必要な、標準的な通信プロトコルです。"},{word:"USB" ,desc:"Universal Serial Busの略。コンピューターにケーブルで周辺機器を接続するための共通規格です。プリンターもUSBでコンピューターに接続して使用することができます（プリンターの機種によっては、オプションのインターフェイスボードが必要になる場合があります）。"},{word:"USBインターフェースボード" ,desc:"オプションのUSB接続用拡張カードです。プリンターの機種によっては、標準の構成ではUSB接続に対応しておらず、オプションのUSBインターフェースボードが必要になる場合があります。"},{word:"USBクラスドライバー" ,desc:"コンピューターがUSBで接続した周辺機器を制御するためのソフトウェアです。USB対応の周辺機器は機能によって「クラス」と呼ばれるグループに分類され、同じクラスの周辺機器は共通のUSBクラスドライバーを使用することができます。"},{word:"WSD" ,desc:"Web Services on Devicesの略。ネットワーク上のコンピュータや周辺機器を探索するための規格です。ネットワークに接続されているWSD対応のプリンターは、Windows Vista以降のWindowsで自動的に検出されます。"}]},{initial:"あ", words:[{word:"アンインストール" ,desc:"本ガイドでは、インストール済みのドライバーが不要になった場合に、コンピューターから削除することを指します。"},{word:"インストーラー" ,desc:"プリンタードライバーをインストールまたは更新/アンインストールするためのソフトウェアです。"},{word:"インストール" ,desc:"本ガイドでは、プリンタードライバーの構成ファイルをコンピューターにコピーして、プリンタードライバーが使用できる状態にすることを指します。"}]},{initial:"か", words:[{word:"共有プリンター" ,desc:"ネットワーク経由で複数のコンピューターから利用できるよう設定されているプリンターです。ローカルで接続したプリンターに対して、コンピューター上で共有で利用する設定を行なうことができます。"},{word:"クライアント" ,desc:"本ガイドでは、プリントサーバーに接続して共有プリンターをネットワーク経由で使用するコンピューターを指します。"},{word:"更新" ,desc:"本ガイドでは、すでにインストールされているドライバーをバージョンアップすることを指します。"}]},{initial:"さ", words:[{word:"サブネット" ,desc:"ネットワークを小さなグループに分けて管理する場合の単位です。TCP/IP でコンピューターなどの情報機器の住所にあたるIP アドレスは、機器が所属するサブネットのアドレス（ネットワークアドレス）とサブネット内での機器のアドレス（ホストアドレス）から構成されており、上位何ビットがネットワークアドレスかを表す値を「サブネットマスク」と言います。"},{word:"スリープ状態" ,desc:"コンピューターやプリンターなどが、使用する電力を節約している待機状態を指します。電源オフの場合よりも短時間で作業を再開することができます。"}]},{initial:"た", words:[{word:"代替ドライバー" ,desc:"プリントサーバーにインストールされた、クライアントコンピューター用のプリンタードライバーです。ネットワークを経由して代替ドライバーをクライアントコンピューターにインストールできます。"},{word:"デバイス" ,desc:"本ガイドでは、プリンター本体のことを指します。"},{word:"ドライバー" ,desc:"本ガイドでは、プリンタードライバーの略。"}]},{initial:"は", words:[{word:"ファイアウォール" ,desc:"社内LANなどのネットワークへの外部からの不正アクセスを防ぐセキュリティーシステム。<br/>本製品のファイアウォール設定機能を使用すると、特定のIPアドレスを持つコンピューターのみが本製品とデータのやり取りをできるようになり、セキュリティーの向上につながります。"},{word:"部門管理機能" ,desc:"プリンターで、ある特定のグループごとに印刷枚数などの情報を計数/管理するための機能です。"},{word:"プリンタードライバー" ,desc:"コンピューターでプリンターから印刷したり、プリンターの機能を使用するためのソフトウェアです。コンピューターにインストールして使用します。"},{word:"プリントサーバー" ,desc:"自身に接続されたプリンターを他のコンピューターからも利用できるように設定してあるコンピューターです。"},{word:"プロトコル" ,desc:"ネットワークを介してデータの受け渡しを行う際の手順の規則です。おもな通信プロトコルはFTP, DHCP, BOOTP, RARP, HTTP, IPP, SSL, TCP/IPなどです。"},{word:"ページ記述言語" ,desc:"コンピューター上で作成した文書を印刷する際に、プリンターに文字やグラフィックスなどの印刷イメージを指示するための言語です。"},{word:"ヘルプ" ,desc:"ソフトウェアの操作方法などを記載したドキュメントです。コンピューターの画面上で表示されます。プリンタードライバーでは、[ヘルプ]ボタンを押すことで、その画面に対応したオンラインヘルプの項目を呼び出すことができます。"},{word:"ポート" ,desc:"コンピューターが外部とデータをやりとりするための出入り口です。コンピューターからプリンターを利用する場合は、プリントポートを通してデータのやりとりをします。"}]},{initial:"ら", words:[{word:"ローカル" ,desc:"本ガイドでは、ネットワーク上の環境ではなく、実際に手元で操作しているコンピューターやプリンターの環境を指します。"},{word:"ログオン" ,desc:"コンピューターを起動するときやアクセス権が必要な機能を使用するときに、ユーザー名とパスワードを入力して認証を行なうことです。"}]}];